{
  "agrein turner": "Agrein draws on experience as a Commercial Sourcing Advisor, Buyer, and IT Manager to bring structure and dependability to every role. Her background in procurement and project coordination shows strong leadership potential in service and operations management.",
  "kathryn keillor": "Kathryn draws on experience as a Sales Manager, Logistics Supervisor, and Hospitality Captain to lead with energy and accountability. Her hands-on background in customer service and team development shows strong leadership potential in operational leadership within service environments.",
  "raidion fails": "Raidion draws on experience as a U.S. Army Logistics Manager, Operations Analyst, and Product Owner to bring discipline and innovation to every project. His background in process improvement and digital systems shows strong leadership potential in operational management and continuous improvement roles.",
  "shaquille thompson": "Shaquille draws on experience as a Freight Supervisor, Area Manager, and Operations Lead across logistics and fulfillment environments. His background in team management, process improvement, and safety training shows strong leadership potential in large-scale service and operations management.",
  "evan tichenor": "Evan draws on experience as an Editor-in-Chief, Photo Editor, and Customer Service Representative to lead with creativity and precision. His background in journalism and operations coordination shows strong leadership potential in communication, organization, and team management.",
  "ivves mullen": "Ivves draws on experience as a Site Account Manager, Regional Operations Manager, and Fleet Coordinator to bring structure and dependability to complex service operations. His background in janitorial management and transportation logistics shows strong leadership potential in team coordination and client service excellence.",
  "micah scherrei": "Micah draws on experience as a Senior Resident Advisor, Campus Tour Guide, and Site Manager to lead with energy and empathy. His background in student engagement and team supervision shows strong leadership potential in people development and community-driven operations.",
  "kathy telford": "Kathy draws on experience as a Field Operations Manager, Branch Manager, and Employment Specialist to lead with accountability and care. Her background in janitorial management, workforce development, and criminal justice shows strong leadership potential in team building and operational oversight.",
  "lloyd harrison-hines": "Lloyd draws on experience as a General Manager, Operations Manager, and Area Manager to bring focus and accountability to every team he leads. His background in logistics, operations, and staff development shows strong leadership potential in driving efficiency and team performance.",
  "stephany lopez cardona": "Stephany draws on experience as a Business Manager, Project Manager, and Office Leader to bring focus and adaptability to every role. Her background in financial services and team management shows strong leadership potential in client relations and operational efficiency.",
  "jesus garcia": "Jesus draws on experience as a Business Owner, Research Assistant, and Behavioral Technician to bring analytical thinking and initiative to every role. His background in logistics, psychology, and team coordination shows strong leadership potential in operations and problem-solving.",
  "tyler heinle": "Tyler draws on experience as a Data Operations Manager, Senior Teller, and Delivery Supervisor to bring analytical precision and reliability to every team he leads. His background in finance, data management, and process improvement shows strong leadership potential in operations and strategic execution."
}

