{
  "evan tichenor": "Evan blends operations expertise with data storytelling to keep MIT sites running smoothly. He mentors peers on process fixes and keeps projects focused on measurable wins.",
  "raidion fails": "Raidion brings calm leadership to high-volume teams and never misses a detail. He builds trust quickly with supervisors by communicating risks and closing loops fast.",
  "kathryn keillor": "Kathryn energizes crews with clear goals and a customer-first mindset. She is steadily building supervisory chops through cross-functional projects and daily coaching huddles.",
  "micah scherrei": "Micah thrives on turning ambiguous challenges into disciplined routines. He is known for documenting improvements and sharing playbooks that lift the whole shift.",
  "agrein turner": "Agrein partners with stakeholders from HR to Ops to keep initiatives on track. Her planning skills are matched by a calm presence that keeps teams confident under pressure.",
  "kathy telford": "Kathy champions quality and safety while maintaining empathetic support for her team. She is the go-to for onboarding new associates and reinforcing consistent service standards.",
  "lloyd harris hines": "Lloyd analyzes performance trends and translates them into actionable task lists. He is a dependable teammate who elevates accountability without losing the human touch.",
  "stephany lopez": "Stephany builds rapport quickly and ensures stakeholders feel heard throughout every engagement. She pairs strong follow-through with a talent for aligning resources around the mission.",
  "stephany lopez cardona": "Stephany integrates customer feedback into daily standups and keeps projects aligned to expectations. Her calm communication style encourages teams to adopt new processes without friction.",
  "shaquille thompson": "Shaquille elevates shift morale with clear direction and hands-on coaching. He thrives in fast-paced environments where decisive action keeps service levels high.",
  "ivves mullen": "Ivves is a systems thinker who connects ops metrics to practical behavior changes on the floor. He documents best practices so the next team can replicate wins without slowing down.",
  "jesus garcia": "Jesus approaches each assignment with a customer-first lens and strong logistical skills. He collaborates closely with mentors to translate training into measurable site impact.",
  "tyler heinle": "Tyler blends people-first leadership with data-driven follow-up to keep crews accountable. He is quick to pilot new ideas and share lessons learned across the network.",
  "cesar burgos": "Cesar is known for staying cool under pressure and guiding teams through unexpected challenges. He builds trust through consistent follow-up and willingness to roll up his sleeves.",
  "emmanuel": "Emmanuel combines a process mindset with strong interpersonal skills to unify stakeholders. He is proactive about surfacing risks early and partnering on workable solutions.",
  "jeremiah nguyen": "Jeremiah excels at spotting workflow bottlenecks and rallying teammates to clear them. His approachable style and detailed planning ensure commitments become finished work."
}


